jaszczurtd/JaszczurHAL/tests/test_rp2040_adc_shared.cpp
#include "hal/impl/rp2040/rp2040_adc_shared.h"
#include "hal/system/hal_sync.h"
#include "hardware/adc.h"
#include "utils/unity.h"

#include <atomic>
#include <mutex>
#include <thread>

struct hal_mutex_impl_t {
  std::mutex mutex;
};

static std::atomic<unsigned int> s_mutex_create_count{0u};
static std::atomic<unsigned int> s_adc_init_count{0u};
static std::atomic<unsigned int> s_unprotected_call_count{0u};
static std::atomic<unsigned int> s_selected_input{0u};
static thread_local hal_mutex_t s_locked_mutex = nullptr;

extern "C" hal_mutex_t hal_mutex_create(void) {
  s_mutex_create_count.fetch_add(1u);
  return new hal_mutex_impl_t;
}

extern "C" hal_mutex_t jh_hal_mutex_try_create(void) {
  return hal_mutex_create();
}

extern "C" void hal_mutex_lock(hal_mutex_t mutex) {
  mutex->mutex.lock();
  s_locked_mutex = mutex;
}

extern "C" bool hal_mutex_try_lock(hal_mutex_t mutex) {
  if (!mutex->mutex.try_lock()) {
    return false;
  }
  s_locked_mutex = mutex;
  return true;
}

extern "C" void hal_mutex_unlock(hal_mutex_t mutex) {
  s_locked_mutex = nullptr;
  mutex->mutex.unlock();
}

extern "C" void hal_mutex_destroy(hal_mutex_t mutex) { delete mutex; }

extern "C" void hal_critical_section_enter(void) {}
extern "C" void hal_critical_section_exit(void) {}

static void record_adc_call(void) {
  if (s_locked_mutex == nullptr) {
    s_unprotected_call_count.fetch_add(1u);
  }
}

extern "C" void adc_init(void) {
  record_adc_call();
  s_adc_init_count.fetch_add(1u);
}

extern "C" void adc_gpio_init(unsigned int) { record_adc_call(); }

extern "C" void adc_select_input(unsigned int input) {
  record_adc_call();
  s_selected_input.store(input);
  std::this_thread::yield();
}

extern "C" uint16_t adc_read(void) {
  record_adc_call();
  std::this_thread::yield();
  return (uint16_t)(1000u + s_selected_input.load());
}

extern "C" void adc_set_temp_sensor_enabled(bool) { record_adc_call(); }

extern "C" void sleep_ms(uint32_t) {
  record_adc_call();
  std::this_thread::yield();
}

void setUp(void) {}
void tearDown(void) {}

static void
test_gpio_and_temperature_reads_share_one_adc_transaction_lock(void) {
  rp2040_adc_set_resolution(12u);
  TEST_ASSERT_EQUAL_INT(1000, rp2040_adc_read_gpio(26u));
  TEST_ASSERT_EQUAL_UINT16(1004u, rp2040_adc_read_temperature_raw());

  std::atomic<unsigned int> failures{0u};
  std::thread gpio_reader([&failures]() {
    for (unsigned int i = 0u; i < 500u; ++i) {
      if (rp2040_adc_read_gpio(26u) != 1000) {
        failures.fetch_add(1u);
      }
    }
  });
  std::thread temperature_reader([&failures]() {
    for (unsigned int i = 0u; i < 500u; ++i) {
      if (rp2040_adc_read_temperature_raw() != 1004u) {
        failures.fetch_add(1u);
      }
    }
  });
  gpio_reader.join();
  temperature_reader.join();

  TEST_ASSERT_EQUAL_UINT(0u, failures.load());
  TEST_ASSERT_EQUAL_UINT(0u, s_unprotected_call_count.load());
  TEST_ASSERT_EQUAL_UINT(1u, s_mutex_create_count.load());
  TEST_ASSERT_EQUAL_UINT(1u, s_adc_init_count.load());
}

static void
test_dma_reservation_blocks_polled_adc_without_reprogramming_it(void) {
  const unsigned int calls_before = s_unprotected_call_count.load();
  const unsigned int init_before = s_adc_init_count.load();

  TEST_ASSERT_EQUAL_INT(HAL_OK, rp2040_adc_acquire_dma());
  TEST_ASSERT_EQUAL_INT(HAL_EBUSY, rp2040_adc_acquire_dma());
  // No scan reader is installed, so no input has a sample to offer: the
  // read says so instead of returning a zero that looks like a conversion.
  TEST_ASSERT_EQUAL_INT(-1, rp2040_adc_read_gpio(26u));
  TEST_ASSERT_EQUAL_UINT16(0u, rp2040_adc_read_temperature_raw());
  uint16_t raw = 123u;
  TEST_ASSERT_EQUAL_INT(HAL_EBUSY, rp2040_adc_read_temperature_raw_ex(&raw));
  TEST_ASSERT_EQUAL_UINT16(123u, raw);
  TEST_ASSERT_EQUAL_UINT(init_before, s_adc_init_count.load());
  TEST_ASSERT_EQUAL_UINT(calls_before, s_unprotected_call_count.load());

  rp2040_adc_release_dma();
  TEST_ASSERT_EQUAL_INT(1000, rp2040_adc_read_gpio(26u));
  TEST_ASSERT_EQUAL_INT(HAL_OK, rp2040_adc_read_temperature_raw_ex(&raw));
  TEST_ASSERT_EQUAL_UINT16(1004u, raw);
  TEST_ASSERT_EQUAL_INT(HAL_OK, rp2040_adc_acquire_dma());
  rp2040_adc_release_dma();
}

static bool s_reader_called = false;

static bool fake_scan_reader(uint8_t input, uint16_t *raw) {
  s_reader_called = true;
  if (input == 0u) {
    *raw = 2048u;
    return true;
  }
  if (input == ADC_TEMPERATURE_CHANNEL_NUM) {
    *raw = 900u;
    return true;
  }
  return false;
}

static void test_scan_reader_serves_polled_reads_while_dma_owns_the_adc(void) {
  const unsigned int calls_before = s_unprotected_call_count.load();
  TEST_ASSERT_EQUAL_INT(HAL_OK, rp2040_adc_acquire_dma());
  rp2040_adc_set_scan_reader(fake_scan_reader);
  s_reader_called = false;
  // Scanned inputs read the newest scanned sample without touching the
  // converter; an input outside the scan cannot be converted now and reports
  // -1 rather than a zero indistinguishable from a real sample.
  TEST_ASSERT_EQUAL_INT(2048, rp2040_adc_read_gpio(26u));
  TEST_ASSERT_TRUE(s_reader_called);
  TEST_ASSERT_EQUAL_INT(-1, rp2040_adc_read_gpio(27u));
  uint16_t raw = 0u;
  TEST_ASSERT_EQUAL_INT(HAL_OK, rp2040_adc_read_temperature_raw_ex(&raw));
  TEST_ASSERT_EQUAL_UINT16(900u, raw);
  TEST_ASSERT_EQUAL_UINT(calls_before, s_unprotected_call_count.load());
  // Releasing the DMA owner also drops the reader: DACless never sets one
  // and must keep seeing plain conversions afterwards.
  rp2040_adc_release_dma();
  TEST_ASSERT_EQUAL_INT(1000, rp2040_adc_read_gpio(26u));
  TEST_ASSERT_EQUAL_INT(HAL_OK, rp2040_adc_acquire_dma());
  s_reader_called = false;
  TEST_ASSERT_EQUAL_INT(-1, rp2040_adc_read_gpio(26u));
  TEST_ASSERT_FALSE(s_reader_called);
  TEST_ASSERT_EQUAL_INT(HAL_EBUSY, rp2040_adc_read_temperature_raw_ex(&raw));
  rp2040_adc_release_dma();
}

int main(void) {
  UNITY_BEGIN();
  RUN_TEST(test_gpio_and_temperature_reads_share_one_adc_transaction_lock);
  RUN_TEST(test_dma_reservation_blocks_polled_adc_without_reprogramming_it);
  RUN_TEST(test_scan_reader_serves_polled_reads_while_dma_owns_the_adc);
  return UNITY_END();
}
